export const navItems = [
    { title: 'Календарь' },
    { title: 'Тренировки' },
    { title: 'Достижения' },
    { title: 'Профиль' },
];

export const cardText = [
    {
        text: `С CleverFit ты сможешь:`,
    },
    {
        text: `CleverFit — это не просто приложение, а твой личный помощник в мире фитнеса. Не откладывай на завтра — начни тренироваться уже сегодня!`,
    },
];

export const cardTextList = [
    {
        key: 1,
        description: `— планировать свои тренировки на календаре, выбирая тип и
уровень нагрузки;`,
    },
    {
        key: 2,
        description: `— отслеживать свои достижения в разделе статистики, сравнивая свои
      результаты с нормами и рекордами;`,
    },
    {
        key: 3,
        description: `— создавать свой профиль, где ты можешь загружать
    свои фото, видео и отзывы о тренировках;`,
    },
    {
        key: 4,
        description: `— выполнять расписанные тренировки для
    разных частей тела, следуя подробным инструкциям и советам профессиональных
    тренеров.`,
    },
];

export const cardAction = [
    {
        title: 'Расписать тренировки',
        button: 'Тренировки',
        icon: `heart`,
    },
    {
        title: 'Назначить календарь',
        button: 'Календарь',
        icon: 'calendar',
    },
    {
        title: 'Заполнить профиль',
        button: 'Профиль',
        icon: 'profile',
    },
];
