import fryingPanImg from '../assets/img/icons/navbar/frying-pan.svg';
import kidImg from '../assets/img/icons/navbar/kid.svg';
import nationalImg from '../assets/img/icons/navbar/national.svg';
import potImg from '../assets/img/icons/navbar/pot.svg';
import vegImg from '../assets/img/icons/navbar/veg.svg';

export const relevantHomePageData = {
    title: 'Веганская кухня',
    text: 'Интересны не только убеждённым вегетарианцам, но и тем, кто хочет попробовать вегетарианскую диету и готовить вкусные вегетарианские блюда.',
    cardV: [
        {
            title: 'Картошка, тушенная с болгарским перцем и фасолью в томатном соусе',
            text: 'Картошка, тушенная с болгарским перцем, фасолью, морковью и луком, -  вариант сытного блюда на каждый день. Фасоль в данном случае заменяет мясо, делая рагу сытным и питательным. Чтобы сократить время  приготовления, возьмём консервированную фасоль. Блюдо хоть и простое, но в полной мере наполнено ароматами и имеет выразительный вкус за счёт  добавления томатной пасты.',
            badgeText: 'Вторые блюда',
            badgeIcon: fryingPanImg,
            bookmarkCount: 1,
            likeCount: 1,
        },
        {
            title: 'Капустные котлеты',
            text: 'Капустные котлеты по этому рецепту получаются необычайно пышными и  невероятно вкусными. Мягкий вкус и лёгкая пряная нотка наверняка помогут сделать эти чудесные котлеты из капусты одним из ваших любимых овощных  блюд.',
            badgeText: 'Вторые блюда',
            badgeIcon: fryingPanImg,
            bookmarkCount: 2,
            likeCount: 1,
        },
    ],
    cardH: [
        {
            icon: fryingPanImg,
            title: 'Стейк для вегетарианцев',
        },
        {
            icon: fryingPanImg,
            title: 'Котлеты из гречки и фасоли',
        },
        {
            icon: potImg,
            title: 'Сырный суп с лапшой и брокколи',
        },
    ],
};

export const relevantVegPageData = {
    title: 'Десерты, выпечка',
    text: 'Без них невозможно представить себе ни современную, ни традиционную  кулинарию. Пироги и печенья, блины, пончики, вареники и, конечно, хлеб - рецепты изделий из теста многообразны и невероятно популярны.',
    cardV: [
        {
            title: 'Бананово-молочное желе',
            text: 'Молочное желе – это просто, вкусно и полезно, ведь для его приготовления в качестве основы используется молоко.',
            badgeText: 'Детские блюда',
            badgeIcon: kidImg,
            bookmarkCount: 1,
            likeCount: 1,
        },
        {
            title: 'Нежный сливочно-сырный крем для кексов',
            text: 'Сливочно-сырным кремом можно украсить кексы, либо другую выпечку, а также этим кремом можно наполнить заварные пирожные.',
            badgeText: 'Детские блюда',
            badgeIcon: kidImg,
            bookmarkCount: 2,
            likeCount: 1,
        },
    ],
    cardH: [
        {
            icon: kidImg,
            title: 'Домашние сырные палочки',
        },
        {
            icon: nationalImg,
            title: 'Панкейки',
        },
        {
            icon: vegImg,
            title: 'Воздушное банановое печенье на сковороде',
        },
    ],
};

export const relevantPopularPageData = {
    title: 'Веганская кухня',
    text: 'Интересны не только убеждённым вегетарианцам, но и тем, кто хочет попробовать вегетарианскую диету и готовить вкусные вегетарианские блюда.',
    cardV: [
        {
            title: 'Картошка, тушенная с болгарским перцем и фасолью в томатном соусе',
            text: 'Картошка, тушенная с болгарским перцем, фасолью, морковью и луком, -  вариант сытного блюда на каждый день. Фасоль в данном случае заменяет мясо, делая рагу сытным и питательным. Чтобы сократить время  приготовления, возьмём консервированную фасоль. Блюдо хоть и простое, но в полной мере наполнено ароматами и имеет выразительный вкус за счёт  добавления томатной пасты.',
            badgeText: 'Вторые блюда',
            badgeIcon: fryingPanImg,
            bookmarkCount: 1,
            likeCount: 1,
        },
        {
            title: 'Капустные котлеты',
            text: 'Капустные котлеты по этому рецепту получаются необычайно пышными и  невероятно вкусными. Мягкий вкус и лёгкая пряная нотка наверняка помогут сделать эти чудесные котлеты из капусты одним из ваших любимых овощных  блюд.',
            badgeText: 'Вторые блюда',
            badgeIcon: fryingPanImg,
            bookmarkCount: 2,
            likeCount: 1,
        },
    ],
    cardH: [
        {
            icon: fryingPanImg,
            title: 'Стейк для вегетарианцев',
        },
        {
            icon: fryingPanImg,
            title: 'Котлеты из гречки и фасоли',
        },
        {
            icon: potImg,
            title: 'Стейк для вегетарианцев',
        },
    ],
};
